var MongoClient = require('mongodb').MongoClient;
let connectionString = "mongodb://localhost:27017/";

let dbs = {
  "current": "dekaneh_target",
  "target": "dekaneh_product_abstract_target"
};
let main = async () => {

  let startTime = (new Date()); 
  console.log("migrating product abstract");
  let connection = await MongoClient.connect(connectionString, { useNewUrlParser: true });

  let target = connection.db(dbs.target);
  let admin = connection.db("admin");
  console.log("droping target database");
  await target.dropDatabase();
  console.log("done droping target database");

  console.log("copying database");
  let mongoCommand = { copydb: 1, fromhost: "localhost", fromdb: dbs.current, todb: dbs.target };

  await admin.command(mongoCommand);


  console.log("done copying database");

  // migrating products 
  console.log("migrating products");


  let toSkip = ['﻿سيفة العائلة', 'نكاشات أسنان خشب', 'نكاشات أذان خشب', 'صابون بيرل وايت رويال', 'صابون بريميوم غولد رويال', 'صابون ماتيز مشكل', 'فراشي أسنان كوبور', 'صابون عطور رائحة الورد', 'صابون ليمون فا', 'معجون أسنان سيجنال 120مل', 'صابون حلم الطبيعة مدار', 'صابون ياغورت ولوز فا', 'صابون حيوية أكوا فا', 'صابون حرير ومغنوليا فا', 'صابون فروتيل كريب فروت', 'صابون فروتيل رمان', 'صابون فروتيل بابايا', 'صابون سيلك زهر الكرز', 'صابون سيلك أوركيد', 'صابون سيلك زيتون', 'صابون سيلك لؤلؤ', 'صابون سيلك دراق', 'صابون سيلك أملاح البحر', 'صابون باشن فروت فا', 'صابون بينك باشن فا', 'صابون سبورت فا', 'صابون فانيليا فا', 'صابون ياغورت وألوفيرا فا', 'اسفنجات جلي أكاليل', 'معجون أسنان سو وايت 120مل', 'معجون أسنان نعناع سو وايت 120مل', 'صابون عناية الرفاهية مدار', 'صابون بينك باشن فا', 'صابون باشن فروت فا', 'صابون سبورت فا', 'صابون فانيليا فا', 'محارم الكرزة 500غ', 'محارم كومفورت 500غ', 'محارم ليلي 200 منديل', 'سكر سيدي هشام 1كغ', 'سكر غيث 1كغ', 'محارم رند 500غ', 'محارم جيب ديمة', 'محارم لوف 110 منديل', 'محارم تواليت لوف 4 رول', 'محارم تواليت ليلي جامبو 6 رول', 'محارم تواليت ليلي اقتصادي 6 رول', 'محارم مطبخ ليلي 2رول', 'ملمع زجاج بوفالو 500مل', 'سائل يدين رمان بوفالو 900مل', 'سائل يدين نسيم البحر بوفالو 900مل', 'سائل يدين جوري بوفالو 900مل', 'سائل يدين عطر منعش بوفالو 900مل', 'سائل يدين زيتون بوفالو 900مل', 'بطاريات توشيبا', 'كبريت', 'حجر حمام معطر', 'عصير برتقال وجزر فروتي 1ليتر', 'معقم للأيدي تاتش 60مل', 'ميرندا تفاح بلاستيك 330مل', 'ميرندا برتقال 330مل', 'بيبسي بلاستيك 330مل', 'سفن أب بلاستيك 330مل', 'عصير مانغو فروتي 1ليتر', 'ماستر كولا برتقال 250مل', 'ماستر كولا أورجينال 250مل', 'ماستر كولا سادة 250مل', 'ماستر كولا فواكه 250مل', 'ماستر كولا تفاح أخضر 250مل', 'عصير عنب فروتي 1ليتر', 'نسكافيه نستله ماي كاب 3*1', 'روبي ميكس 3*1', 'حليب موز ميلك مان 200مل', 'حليب فريز ميلك مان 200مل', '24 قطعة ذرة توليدو 340غ + قطعة مجاناً', 'بيبسي 330مل', 'عصير فنتازيا برتقال 250مل', 'عصير فنتازيا فريز وموز 250مل', 'عصير جوافة فنتازيا 250مل', 'عصير برتقال وجزر فنتازيا 250مل', 'عصير فنتازيا مانجو 250مل', 'سفن أب 330مل', 'بانوراما جوزهند', 'شيبس تورتيلا بالنكهة المكسيكية', 'شيبس تورتيلا بنكهة الخضار', 'شيبس تورتيلا بنكهة الذرة الحلوة', 'شيبس تورتيلا بنكهة جبنة الناشو', 'عصير يومي برتقال 250مل', 'عصير يومي فواكه 250مل', 'عصير فروتي برتقال 250مل', 'عصير فروتي مانغا 250مل', 'عصير فروتي أناناس 250مل', 'عصير فروتي برتقال وجزر 250مل', 'عصير فروتي تفاح 250مل', 'عصير برتقال فروتي 200مل', 'عصير برتقال وجزر فروتي 200مل', 'عصير أناناس فروتي 200مل', 'عصير مانغو فروتي 200مل', 'عصير برتقال وجزر سلس 330مل', 'عصير مانجو سلس 330مل', 'عصير برتقال سلس 330مل', 'عصير برتقال سلس 200مل', 'مندرين أيس تي 330مل', 'مندرين فينيتو 330مل', 'عصير أوغاريت برتقال 330مل', 'عصير أوغاريت عنب 330مل', 'حليب هوى الشام فريز 200مل', 'حليب هوى الشام شوكولا 200مل', 'حليب هوى الشام موز 200مل', 'حليب ميلك مان شوكولا 200مل', 'شيبس تارغيت بنكهة كريمة البصل', 'شيبس تارغيت بنكهة الخضار', 'شيبس الفك السحري', 'شيبس الفستق السوداني', 'شيبس رولينو', 'شيبس توبسي', 'شيبس سنوبيز', 'شيبس مستركورن حار', 'شيبس مستركورن لبنة وأعشاب', 'شيبس مستركورن بالجبنة الفرنسية', 'شيبس مستركورن مملح', 'شيبس مستركورن بالخل', 'شيبس رانش عائلي', 'شيبس رانش صغير', 'عصير أوغاريت أناناس 330مل', 'عصير أوغاريت فواكه 330مل', 'ميرندا تفاح 330مل', 'ميرندا برتقال 330مل', '24 قطعة أناناس توليدو 565غ + قطعة مجاناً', 'اشترِ عبوتين سائل أيدي سيمبلي واحصل على الثالثة مجاناً', 'فانيلا فاين رويال ظروف', 'بيكينغ باودر فاين رويال ظروف', 'حليب حليبنا ظروف 22غ', 'أندومي خضار', 'أندومي شعيرية مقلية', 'أندومي دجاج بالبصل', 'أندومي دجاج خاصة', 'أندومي كاري دجاج', 'خميرة بلقيس', 'حليب كامل الدسم هوى الشام 1ليتر', 'بيبسي 1ليتر', 'بيبسي 2.25ليتر', 'مندرين فينيتو 2.25ليتر', 'مندرين فينيتو 1ليتر', 'كراش 2.25ليتر', 'ميرندا تفاح 1ليتر', 'ميرندا برتقال 1ليتر', 'سفن أب دايت 1ليتر', 'سفن أب 1ليتر', 'حليب خالي الدسم هوى الشام 1ليتر', 'كراش 1ليتر', 'ببسي دايت 1ليتر', 'ميرندا برتقال 330مل', 'ميرندا تفاح 330مل'];

  let skipped = 0;

  let matches = [];
  let skip = ({ nameAr }) => {
    let match = toSkip.find(s => s.includes(nameAr.trim()) || nameAr.includes(s.trim()));
    if (match) {
      skipped++;
      matches.push(match);
      return true;
    }
    return false;
  };

  for (let product of await target.collection('products').find({}).toArray()) {
    //create product abstract for each product 
    if (skip(product))
      continue;

    let { nameEn, nameAr, categoryId, subCategoryId, manufacturerId, media, ...rest } = product;
    let productAbstract = { nameEn, nameAr, categoryId, subCategoryId, manufacturerId, media };
    productAbstract.officialConsumerPrice = 0;
    productAbstract.officialMassMarketPrice = 0;

    let { insertedIds } = await target.collection('productAbstract').insert(productAbstract);

    insertedIds = insertedIds[0];
    product.productAbstractId = insertedIds;
    product.parentCount = 1;
    await target.collection('products').updateOne({ _id: product._id }, { $set: product });

    //console.log(promise); 

  }

  console.log(`Skipped ${skipped} of ${toSkip.length} `);
  let notSkipped = toSkip.filter(s => !matches.includes(s));

  console.log("done migrating products");


  connection.close();

  let endTime = new Date(); 
  let diff = endTime - startTime ; 
  console.log(`Finished in ${diff}ms`); 

};

main();